Revit 2027 API
AdaptivePointType Enumeration
 An enumerated type containing possible types for Adaptive Points.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum AdaptivePointType
Public Enumeration AdaptivePointType
public enum class AdaptivePointType
type AdaptivePointType
Members
Member name | Value | Description
PlacementPoint | 1 |  Placement Point.
ReferencePoint | 0 |  Reference Point.
ShapeHandlePoint | 2 |  Shape Handle Point.
See Also
Reference
Autodesk.Revit.DB Namespace